'''
# 2x1 (1개)
-

# 2x2 (3개)
=  ||  ㅁ

# 2x3 (5개)
|||
=|  |=
|ㅁ  ㅁ|

# 2x4 (11개)
||||  
||ㅁ  ||=  |ㅁ|  |=|  ㅁ|| =|| 
ㅁ=    =ㅁ  ==  ㅁㅁ
# 2x5 (21개)
|||||
|||ㅁ  |||=  ||ㅁ|  ||=|  |ㅁ||  |=||  ㅁ|||  =|||
|ㅁㅁ  |ㅁ=  |=ㅁ  |==  ㅁ|ㅁ  ㅁ|=  =|ㅁ  =|=  ㅁㅁ|  ㅁ=|  =ㅁ|  ==|

f(1) = 1
f(2) = 3 일 때,
f(n) = f(n-1) + 2f(n-2)
'''
import sys

n = int(sys.stdin.readline())
if n < 3:
    print(1 if n == 1 else 3)
else:
    dp = [0]*(n+1)

    dp[1], dp[2] = 1, 3

    for i in range(3,n+1):
        dp[i] = (dp[i-1] + 2*dp[i-2]) % 10007

    print(dp[n])